test/sonos_test/post_request_1.txt

POST /MediaRenderer/RenderingControl/Control HTTP/1.1
CONNECTION: close
ACCEPT-ENCODING: gzip
HOST: 192.168.2.200:1400
USER-AGENT: Linux UPnP/1.0 Sonos/57.10-25040 (MDCR_MacBookPro15,1)
X-Sonos-Api-Key: 8525505d-78e5-4dab-943f-bafe95b6074d
X-Sonos-Corr-Id: f2fdc50b-f163-4717-af44-6e57f670d332
CONTENT-LENGTH: 323
CONTENT-TYPE: text/xml; charset="utf-8"
X-SONOS-TARGET-UDN: uuid:RINCON_000E583472BC01400
SOAPACTION: "urn:schemas-upnp-org:service:RenderingControl:1#SetVolume"

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:SetVolume xmlns:u="urn:schemas-upnp-org:service:RenderingControl:1"><InstanceID>0</InstanceID><Channel>Master</Channel><DesiredVolume>2</DesiredVolume></u:SetVolume></s:Body></s:Envelope>
